In [14]:
import pandas as pd
import pyodbc as db
import os
from dotenv import load_dotenv
load_dotenv()

True

In [15]:
# VARIABLES PARA CONECTAR A MI BASE DE DATOS EN SQL SERVER
server = os.getenv("SERVER")
database = os.getenv("DATABASE")
username = os.getenv("USERNAME")
password = os.getenv("PASSWORD")
driver = os.getenv("DRIVER")

In [16]:
#CONEXIÓN
conn = db.connect('DRIVER='+driver+';SERVER='+server+';DATABASE='+database+';UID='+username+';PWD='+ password)

In [17]:
#CONSULTA 1 SQL a mi tabla sin limpiar
sql_query_db = "SELECT DISTINCT artists FROM datos_spotify ORDER BY artists"

In [18]:
#LEYENDO LA CONSULTA SQL
db_data = pd.read_sql(sql_query_db,conn)

C:\Users\Aaron\AppData\Local\Temp\ipykernel_31384\1723393235.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  db_data = pd.read_sql(sql_query_db,conn)

In [6]:
#LEYENDO EL ARCHIVO CSV
csv_data = pd.read_csv('C:/Users/Aaron/Desktop/python_Analisis/Portafolio/data_spotify_clean.csv')

In [19]:
#IMPRIMIENDO LA CONSULTA EN EL FRAME DE LA BASE DE DATOS
db_data

                                                 artists
0                                                   None
1                                                 !nvite
2                                  "Puppy Dog Pals" Cast
3                                    "Weird Al" Yankovic
4      #Kids;Nursery Rhymes;Nursery Rhymes and Kids S...
...                                                  ...
31424                                                黃仲崑
31425                                                 黃妃
31426                                                黃小琥
31427                                                黃敏華
31428                                            龍藏Ryuzo

[31429 rows x 1 columns]

In [8]:
#EXTRAYENDO VALORES UNICOS DEL ARCHIVO CSV DEL CAMPO ARTISTS Y MOSTRANDOLOS EN UN DATAFRAME
valores_unicos=set(csv_data['artists'].unique())
data_frame_csv = pd.DataFrame(valores_unicos)
data_frame_csv

                                                       0
0                                               Cody Fry
1                     Ruffneck;Yavahn;Sharam Jey;Kolombo
2                                                 Sports
3                              Capital Inicial;Seu Jorge
4                                       DJ Ghost Floripa
...                                                  ...
31433  Frankie Knuckles;Director's Cut;Eric Kupper;Ja...
31434                                     Steve Aoki;BTS
31435                   Dub Pistols;Cutty Ranks;Seanie T
31436                                    Mott The Hoople
31437                     Anirudh Ravichander;Inno Genga

[31438 rows x 1 columns]

In [19]:
#CONSULTA SQL 2 FALLANDO
sql_query = """
SELECT t1.artists as artistDB, t2.artists as artists_csv
FROM datos_spotify AS t1
FULL OUTER JOIN(
    SELECT DISTINCT artists FROM {csv_data}
)t2
ON t1.artists= t2.artists
WHERE t1.artists IS NULL OR t2.artists IS NULL
"""

In [9]:
#VER CUALES SON LOS QUE FALTAN "SET" ES UNA ESTRUCTURA QUE NO PERMITE DUPLICADOS
artists_csv = set(csv_data['artists'])
artists_bd = set(db_data['artists'])

In [10]:
#AVERIGUANDO QUE ARTISTAS FALTAN EN LA BASE DE DATOS
artistas_faltantes_en_DB= artists_csv-artists_bd
data_frame_artists_faltantes_DB = pd.DataFrame(artistas_faltantes_en_DB)
data_frame_artists_faltantes_DB

                                    0
0                                LISA
1                    Desejo de Menina
2                            Deadlife
3                    DJ Fixx;Ondamike
4                        LOS HERMANOS
5                    Surade|3AM VIBES
6   Ralphi Rosario;Donna Blakely;lego
7                               TERRA
8                               Shine
9                                 NaN
10                             FISHER

In [11]:
# AVERIGUANDO QUE ARTISTAS FALTAN EN EL ARCHIVO CSV
artistas_faltantes_en_csv=artists_bd-artists_csv
data_frame_artists_faltantes_csv = pd.DataFrame(artistas_faltantes_en_csv)
data_frame_artists_faltantes_csv

                  0
0  Surade;3AM VIBES
1              None

In [ ]:
#CONCLUSIÓN NORMALIZAR LOS DATOS EN ARTISTAS